In [18]:
import pandas as pd
dict1 ={'Name':['Priyang','Aadhya','Krisha','Vedant','Parshv',
                'Mittal','Archana'],
                'Marks':[98,89,99,87,90,83,82],
                'Grades':['AA','AB','AA','AB','AC','BA','BB']
               }
df1=pd.DataFrame(dict1,index=['stu1','stu2','stu3','stu4','stu5',
                             'stu6','stu7'])

In [19]:
df1

         Name  Marks Grades
stu1  Priyang     98     AA
stu2   Aadhya     89     AB
stu3   Krisha     99     AA
stu4   Vedant     87     AB
stu5   Parshv     90     AC
stu6   Mittal     83     BA
stu7  Archana     82     BB

##### 1. Students having marks greater than 90

In [23]:
x=df1['Marks']>90

In [24]:
df1[x]

         Name  Marks Grades
stu1  Priyang     98     AA
stu3   Krisha     99     AA

In [26]:
df1[df1['Marks']>90]

         Name  Marks Grades
stu1  Priyang     98     AA
stu3   Krisha     99     AA

###### 2. Students having "AB" grade

In [29]:
df1[df1['Grades']=="AB"]

        Name  Marks Grades
stu2  Aadhya     89     AB
stu4  Vedant     87     AB

###### 3. Students having Marks greater than 80 and havingÂ  "AB" Grade

In [33]:
df1[(df1['Marks']>80) & (df1['Grades']=="AB")]

        Name  Marks Grades
stu2  Aadhya     89     AB
stu4  Vedant     87     AB

##### 4. Name of the students having marks greater than 90

In [37]:
df1[df1['Marks']>90]['Name']

stu1    Priyang
stu3     Krisha
Name: Name, dtype: object

##### 5. Name of the students having "AB" Grade

In [41]:
df1[df1['Grades']=="AB"]['Name']

stu2    Aadhya
stu4    Vedant
Name: Name, dtype: object

##### loc:  Access a group of rows and columns by label(s)  or a boolean array
##### 6. Students having marks greater than 90 [loc]

In [85]:
df1.loc[df1['Marks']>90]

         Name  Marks Grades
stu1  Priyang     98     AA
stu3   Krisha     99     AA

###### 7. Students having Marks greater than 80 and having  "AB" Grade[loc]

In [87]:
df1.loc[(df1['Marks']>80)  & (df1['Grades']=="AB")]

        Name  Marks Grades
stu2  Aadhya     89     AB
stu4  Vedant     87     AB

###### Access a group of rows and columns by integer position(s) or a boolean array
##### 8. Students having marks greater than 90 [iloc]

In [92]:
df1[df1.iloc[:,1]>90]

         Name  Marks Grades
stu1  Priyang     98     AA
stu3   Krisha     99     AA


###### 9. Students having Marks greater than 80 and having  "AB" Grade [iloc]

In [94]:
df1[(df1.iloc[:,1]>80) & (df1.iloc[:,2]=="AB")]

        Name  Marks Grades
stu2  Aadhya     89     AB
stu4  Vedant     87     AB

##### 10. Name of the students having "AB" Grade [iloc]

In [98]:
df1[df1.iloc[:,2]=="AB"]["Name"]

stu2    Aadhya
stu4    Vedant
Name: Name, dtype: object